OIC/PROCESS_HR_REQUEST/icspackage/project/PROCESS_HR_REQUEST_02.01.0000/resources/application_57/inbound_58/resourcegroup_59/HR_Service_REQUEST.wsdl

<wsdl:definitions targetNamespace="http://gcomputer.net/webservices/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" xmlns:s="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tm="http://microsoft.com/wsdl/mime/textMatching/" xmlns:tns="http://gcomputer.net/webservices/" xmlns:plnk="http://schemas.xmlsoap.org/ws/2003/05/partner-link/">  <wsdl:types>    <s:schema elementFormDefault="qualified" targetNamespace="http://gcomputer.net/webservices/">      <s:element name="TodaysDilbert">        <s:complexType/>      </s:element>      <s:element name="TodaysDilbertResponse">        <s:complexType>          <s:sequence>            <s:element maxOccurs="1" minOccurs="0" name="TodaysDilbertResult" type="s:string"/>          </s:sequence>        </s:complexType>      </s:element>      <s:element name="DailyDilbert">        <s:complexType>          <s:sequence>            <s:element maxOccurs="1" minOccurs="1" name="ADate" type="s:dateTime"/>          </s:sequence>        </s:complexType>      </s:element>      <s:element name="DailyDilbertResponse">        <s:complexType>          <s:sequence>            <s:element maxOccurs="1" minOccurs="0" name="DailyDilbertResult" type="s:string"/>          </s:sequence>        </s:complexType>      </s:element>    </s:schema>  </wsdl:types>  <wsdl:message name="TodaysDilbertSoapIn">    <wsdl:part name="parameters" element="tns:TodaysDilbert"/>  </wsdl:message>  <wsdl:message name="TodaysDilbertSoapOut">    <wsdl:part name="parameters" element="tns:TodaysDilbertResponse"/>  </wsdl:message>  <wsdl:portType name="DilbertSoap_HR_Service_REQUEST">    <wsdl:operation name="TodaysDilbert">      <wsdl:input message="tns:TodaysDilbertSoapIn"/>      <wsdl:output message="tns:TodaysDilbertSoapOut"/>    </wsdl:operation>  </wsdl:portType>  <wsdl:binding name="DilbertSoap_HR_Service_REQUEST-binding" type="tns:DilbertSoap_HR_Service_REQUEST">    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>    <wsdl:operation name="TodaysDilbert">      <soap:operation soapAction="http://gcomputer.net/webservices/TodaysDilbert"/>      <wsdl:input>        <soap:body use="literal"/>      </wsdl:input>      <wsdl:output>        <soap:body use="literal"/>      </wsdl:output>    </wsdl:operation>  </wsdl:binding>  <plnk:partnerLinkType name="hr_service_57_inbound_58">    <plnk:role name="DilbertSoap_HR_Service_REQUEST">      <plnk:portType name="tns:DilbertSoap_HR_Service_REQUEST"/>    </plnk:role>  </plnk:partnerLinkType></wsdl:definitions>